/* --------------------------------------------------------------------------------- */
/*  Пример                                                                           */
/*  example-random-01.с                                                              */
/*                                                                                   */
/*  Пример иллюстрирует выработку последовательности псевдослучайных значений        */
/*  с помощью функции ak_random_value()                                              */
/* --------------------------------------------------------------------------------- */
 #include <stdio.h>
 #include <stdlib.h>
 #include <libakrypt.h>

 int main( void )
{
     int i = 0;
     ak_uint64 x[8];

     for( i = 0; i < 8; i++ ) {
         x[i] = ak_random_value( );
         printf( "%s\n", ak_ptr_to_hexstr( x +i, 8, BlankDirect ));
     }

  return EXIT_SUCCESS;
}

/* --------------------------------------------------------------------------------- */
/*                                                              example-random-01.с  */
/* --------------------------------------------------------------------------------- */
