/* --------------------------------------------------------------------------------- */
/*  Пример                                                                           */
/*  example-hash-02.с                                                                */
/*                                                                                   */
/*  Пример иллюстрирует процесс хеширования заданного массива данных                 */
/* --------------------------------------------------------------------------------- */
 #include <stdio.h>
 #include <stdlib.h>
 #include <libakrypt.h>

 int main( void )
{
   /* контекст алгоритма хеширования */
     struct hash ctx;

  /* определяем данные как массив символов */
  ak_uint8 data[96], out[32];

   /* минимизируем выводимые сообщения аудита */
     ak_log_set_level( ak_log_none );
   /* инициализируем криптографическую библиотеку */
     ak_libakrypt_create( ak_function_log_stderr );

   /* формируем двоичные данные из строки символов */
     ak_hexstr_to_ptr( "ab2328d9ee6f3dbfec908c5a817ccf116be667345d877f9264cbb2d3d34d633636363636363636363636363636363636363636363636363636363636363636360000000000000000000000000000000000000000000000000000000001000000",
                     data, 96, direct );
     printf("Исходный вектор:\n%s\n", ak_ptr_to_hexstr( data, 96, direct ));

   /* инициализируем контекст функции хеширования Стрибог-256 */
     ak_hash_create_streebog256( &ctx );
   /* вычисляем значение функции хеширования */
     ak_hash_ptr( &ctx, data, 96, out, 32 );
   /* уничтожаем контекст функции хеширования */
     ak_hash_destroy( &ctx );

     printf("Хэш-значение:\n%s", ak_ptr_to_hexstr( out, 32, direct ));
   /* завершаем выполнение криптобиблиотеки */
     ak_libakrypt_destroy();

   /* проверяем, что вычисленный результат совпадает с ожидаемым */
     if( strncmp( ak_ptr_to_hexstr( out, 32, direct ),
                  "283d8516e0a835b1b21dd35cee564baacb99ded56b9c5f528b7a3c9f79925508", 64 ) == 0 )
    {
      printf(" Ok\n");
      return EXIT_SUCCESS;
    }

     printf(" No\n");
  return EXIT_FAILURE;
}

/* --------------------------------------------------------------------------------- */
/*                                                                example-hash-02.с  */
/* --------------------------------------------------------------------------------- */
