/* --------------------------------------------------------------------------------- */
/*  Пример                                                                           */
/*  example-hash-01.с                                                                */
/*                                                                                   */
/*  Пример иллюстрирует процесс вызова функций тестирования алгоритмов хеширования.  */
/* --------------------------------------------------------------------------------- */
 #include <stdio.h>
 #include <stdlib.h>
 #include <libakrypt.h>

 int main( void )
{
     bool_t result = ak_false;

   /* устанавливаем максимальный уровень аудита */
     ak_log_set_level( ak_log_maximum );
   /* включаем дополнительные проверки при создании криптографических контекстов */
     ak_libakrypt_set_option_by_name( "use_additional_algorithm_check_context", 1 );
   /* инициализируем криптобиблиотеку */
     ak_libakrypt_create( ak_function_log_stderr );

   /* получаем результат тестирования двух функций хеширования
                                     Стрибог-256 и Стрибог-512 */
     result = ak_libakrypt_test_hash_functions();
     ak_libakrypt_destroy();

  /* возвращамое значение зависит от результата тестирования */
 return result ? EXIT_SUCCESS : EXIT_FAILURE;
}

/* --------------------------------------------------------------------------------- */
/*                                                                example-hash-01.с  */
/* --------------------------------------------------------------------------------- */
