/* ----------------------------------------------------------------------------------------------- */
/*  Copyright (c) 2024 - 2025 by Axel Kenzo, axelkenzo@mail.ru                                     */
/*                                                                                                 */
/*  Файл libakrypt-config.h                                                                        */
/*  (определение макросов для платформы amd64, little endian без libc)                             */
/* ----------------------------------------------------------------------------------------------- */
#ifndef    __LIBAKRYPT_CONFIG_H__
#define    __LIBAKRYPT_CONFIG_H__

/* Базовые определения */
 #define AK_VERSION ("0.10.1")
 #define AK_LITTLE_ENDIAN
 #define AK_DEFAULT_STATIC_BUFFER_SIZE 128

/* Оставляем только поддержку типов данных */
 #define AK_HAVE_STDDEF_H
 #define AK_HAVE_STDINT_H

#endif
/* ----------------------------------------------------------------------------------------------- */
/*                                                                             libakrypt-config.h  */
/* ----------------------------------------------------------------------------------------------- */
